{"pageProps":{"post":{"attributes":{"description":"In the Intermediate React v6 course by Brian Holt from Frontend Masters, explore the concept of React Server Components (RSCs) and their role in rendering components on the server for improved performance and security. Learn how RSCs differ from server-side rendering and how to implement them using frameworks like Next.js. The course also involves building a messaging app to practice hand-coding with RSCs.","keywords":["React","Frontend Masters","Brian Holt","server components","Next.js","web development","RSC"]},"html":"<p>We&#39;ve talked about client-side React apps (no server), static site generation apps (server runs only at compile time), and server-side rendered app (server renders initial page but then client does the rest). Now we&#39;re going to talk about react server components which involves the server even more.</p>\n<h2>What are RSCs?</h2>\n<p>RSCs are not SSR 2.0.</p>\n<p>This is a common misconception that I just want to dispel upfront: these things are relatively unrelated in the sense you can SSR without RSCs, RSCs without SSR, both, or neither!</p>\n<p>RSCs introduce the notion of a server to an ongoing React app. Whereas SSR renders the page once and then is no longer involved in the ongoing React app, RSCs introduce the notion that the server continues to render parts of the app. An RSC is a component that only renders on the server and sends its complete markup to the app – the client-side app doesn&#39;t even have the code to render the component client-side - it can only receive markup from a server and then insert that into the app.</p>\n<blockquote>\n<p>A React server component is a component that <em>only</em> renders on the server.</p>\n</blockquote>\n<p>Why is this useful? For a couple of reasons. No matter how much of an interactive app you have, large swaths of it are inert markup, text, and content. You don&#39;t need React to generate HTML that shows a few headers and paragraphs. We do it because it&#39;s simpler to keep all the code together, but the truth of it is just that: in the grand scheme of things, React is really only needed client-side to add interactivity to an app. Everything else is developer experience and code organization.</p>\n<p>Enter RSCs. For one, they&#39;re just a simple rendering of a page&#39;s content, rendered once, on the server. This means that it doesn&#39;t matter how powerful a user&#39;s device is, the rendering is happening on the server. It also means users aren&#39;t receiving the code for pages they aren&#39;t going to visit, so the bundle can be split pretty well.</p>\n<p>But the biggest, most powerful feature (in my opinion) is that RSCs can use modules that can only be used on the server. Let&#39;s say you&#39;re making a messaging app (like we&#39;re about to): that data all has to be stored in a database somewhere. Normally you&#39;d need a React app fetch that data with a get request, but with RSCs you can just make the request directly in the React component 🤯</p>\n<p>All the secret connection strings you need to have to access your database? Never leave your server! It makes writing React components that read &amp; write from databases, private APIs (like OpenAI, etc.), or need other server-side components very fluent to write. We&#39;re about to see how.</p>\n<h2>Okay so don&#39;t write RSCs by hand</h2>\n<p>But we&#39;re going to lol.</p>\n<p>RSCs are really meant to be written by frameworks and <em>not</em> be written by the masses. It&#39;s a pretty deep integration to build with your bundler (and they only ship Webpack at the moment) and it&#39;s very hard to get right and not get a net-negative on performance.</p>\n<p>It&#39;s also just a lot of code to write, and there already a few frameworks out there that will do it better than you likely have time to.</p>\n<ul>\n<li><a href=\"https://nextjs.org/\">Next.js</a></li>\n<li><a href=\"https://reactrouter.com/\">React Router v7 / Remix</a> (soon)</li>\n<li><a href=\"https://tanstack.com/start/latest\">TanStack Start</a> (soon)</li>\n</ul>\n<p>Next.js works with RSCs today, as of the writing of this course, and embraces the full surface capabilities of RSCs. React Router v7 and TanStack Start both have expressed that at least initially they will be selective of which features that they embrace that make sense with their frameworks (and I support that! No reason to shoehorn it in.)</p>\n<p>We&#39;ll end up writing a whole app in Next.js by the end of the course, but we&#39;re going to start with doing it by hand!</p>\n<h2>NotePasser</h2>\n<p>Remember in school when you would pass notes by hand? No? Well, back in my day (<em>shakes fist at passing cloud</em>) we didn&#39;t have cell phones and had to rely on penmanship and stealthily trying to pass a paper note to our friend in class.</p>\n<p>We&#39;re going to build an app inspired by that today, where we can pass notes from one user to another.</p>\n<p>One note - I had originally built this app to have a full on auth provider, but realized it was adding a lot of complexity to the app that wasn&#39;t teaching you how to do React. Instead this app is going to sort of fake auth. We&#39;re just going to assume whoever is using the app is always user ID <code>1</code>. This is done in the name of simplicity so we can just focus on building React apps, but feel free to later to add a cool auth provider like <a href=\"https://neon.tech/\">Neon Auth</a> (I helped build this one!!), <a href=\"https://clerk.com/\">Clerk</a>, <a href=\"https://www.descope.com/\">Descope</a>, or any other of your favorites.</p>\n","markdown":"\nWe've talked about client-side React apps (no server), static site generation apps (server runs only at compile time), and server-side rendered app (server renders initial page but then client does the rest). Now we're going to talk about react server components which involves the server even more.\n\n## What are RSCs?\n\nRSCs are not SSR 2.0.\n\nThis is a common misconception that I just want to dispel upfront: these things are relatively unrelated in the sense you can SSR without RSCs, RSCs without SSR, both, or neither!\n\nRSCs introduce the notion of a server to an ongoing React app. Whereas SSR renders the page once and then is no longer involved in the ongoing React app, RSCs introduce the notion that the server continues to render parts of the app. An RSC is a component that only renders on the server and sends its complete markup to the app – the client-side app doesn't even have the code to render the component client-side - it can only receive markup from a server and then insert that into the app.\n\n> A React server component is a component that _only_ renders on the server.\n\nWhy is this useful? For a couple of reasons. No matter how much of an interactive app you have, large swaths of it are inert markup, text, and content. You don't need React to generate HTML that shows a few headers and paragraphs. We do it because it's simpler to keep all the code together, but the truth of it is just that: in the grand scheme of things, React is really only needed client-side to add interactivity to an app. Everything else is developer experience and code organization.\n\nEnter RSCs. For one, they're just a simple rendering of a page's content, rendered once, on the server. This means that it doesn't matter how powerful a user's device is, the rendering is happening on the server. It also means users aren't receiving the code for pages they aren't going to visit, so the bundle can be split pretty well.\n\nBut the biggest, most powerful feature (in my opinion) is that RSCs can use modules that can only be used on the server. Let's say you're making a messaging app (like we're about to): that data all has to be stored in a database somewhere. Normally you'd need a React app fetch that data with a get request, but with RSCs you can just make the request directly in the React component 🤯\n\nAll the secret connection strings you need to have to access your database? Never leave your server! It makes writing React components that read & write from databases, private APIs (like OpenAI, etc.), or need other server-side components very fluent to write. We're about to see how.\n\n## Okay so don't write RSCs by hand\n\nBut we're going to lol.\n\nRSCs are really meant to be written by frameworks and _not_ be written by the masses. It's a pretty deep integration to build with your bundler (and they only ship Webpack at the moment) and it's very hard to get right and not get a net-negative on performance.\n\nIt's also just a lot of code to write, and there already a few frameworks out there that will do it better than you likely have time to.\n\n- [Next.js][next]\n- [React Router v7 / Remix][remix] (soon)\n- [TanStack Start][tanstack] (soon)\n\nNext.js works with RSCs today, as of the writing of this course, and embraces the full surface capabilities of RSCs. React Router v7 and TanStack Start both have expressed that at least initially they will be selective of which features that they embrace that make sense with their frameworks (and I support that! No reason to shoehorn it in.)\n\nWe'll end up writing a whole app in Next.js by the end of the course, but we're going to start with doing it by hand!\n\n## NotePasser\n\nRemember in school when you would pass notes by hand? No? Well, back in my day (_shakes fist at passing cloud_) we didn't have cell phones and had to rely on penmanship and stealthily trying to pass a paper note to our friend in class.\n\nWe're going to build an app inspired by that today, where we can pass notes from one user to another.\n\nOne note - I had originally built this app to have a full on auth provider, but realized it was adding a lot of complexity to the app that wasn't teaching you how to do React. Instead this app is going to sort of fake auth. We're just going to assume whoever is using the app is always user ID `1`. This is done in the name of simplicity so we can just focus on building React apps, but feel free to later to add a cool auth provider like [Neon Auth][neon] (I helped build this one!!), [Clerk][clerk], [Descope][descope], or any other of your favorites.\n\n[next]: https://nextjs.org/\n[remix]: https://reactrouter.com/\n[tanstack]: https://tanstack.com/start/latest\n[neon]: https://neon.tech/\n[clerk]: https://clerk.com/\n[descope]: https://www.descope.com/\n","slug":"intro-to-react-server-components","title":"Intro to React Server Components","section":"RSCs without a Framework","icon":"file-code","filePath":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/03-rscs-without-a-framework/A-intro-to-react-server-components.md","nextSlug":"/intermediate-react-v6/lessons/rscs-without-a-framework/rsc-dependencies","prevSlug":"/intermediate-react-v6/lessons/react-render-modes/server-side-rendering"},"allLessons":[{"icon":"info-circle","title":"Welcome","slug":"welcome","lessons":[{"slug":"intro","fullSlug":"/lessons/welcome/intro","title":"Intro","order":"01A","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/01-welcome/A-intro.md","description":"Join Brian Holt in 'Intermediate React v6' for Frontend Masters to gain expertise in server-side and performance capabilities of React. This comprehensive course requires prior knowledge from 'The Complete Intro to React v9' and focuses on leveraging React's inherent tools for web development, making it ideal for anyone with a foundational understanding of React. Brian Holt, an experienced React developer, provides hands-on projects and detailed instructions, enhancing your React skills and knowledge."},{"slug":"my-setup","fullSlug":"/lessons/welcome/my-setup","title":"My Setup","order":"01B","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/01-welcome/B-my-setup.md","description":"Explore Brian Holt's 'Intermediate React v6' course, providing insights on the use of Node.js, preferred development tools like Visual Studio Code, and a balanced perspective on AI integration in coding. Learn how these tools and technologies enhance the process of writing efficient React Server Components, as taught for Frontend Masters."},{"slug":"react-19","fullSlug":"/lessons/welcome/react-19","title":"React 19","order":"01C","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/01-welcome/C-react-19.md","description":"Explore the new features of React 19, focusing on React Server Components, which enable partial server-side rendering of React components, a feature that facilitates safe database querying directly within React. Discover insights into this cutting-edge technology, stable since 2023 and actively developed since 2022, with guidance from expert Brian Holt. Ideal for developers aiming to leverage the latest advancements in React functionality."}],"order":"01"},{"icon":"paint-roller","title":"React Render Modes","slug":"react-render-modes","lessons":[{"slug":"client-side-react","fullSlug":"/lessons/react-render-modes/client-side-react","title":"Client-Side React","order":"02A","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/02-react-render-modes/A-client-side-react.md","description":"Learn about React Server Components in the 'Intermediate React v6' course by Brian Holt on Frontend Masters. Understand the trade-offs of React Server Components and different React rendering methods, including client-side, server-side, and static site generation. Explore the benefits and limitations of these approaches and optimize your web development skills using advanced React techniques."},{"slug":"static-site-generation","fullSlug":"/lessons/react-render-modes/static-site-generation","title":"Static Site Generation","order":"02B","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/02-react-render-modes/B-static-site-generation.md","description":"Learn how to implement Static Site Generation (SSG) using React and Next.js, with expert guidance from Brian Holt in the Intermediate React v6 course at Frontend Masters. Discover the simplicity of generating static web pages for content-heavy sites and explore how this streamlined approach can expedite course creation without sacrificing quality. Enhance your knowledge on using modern frameworks like Astro and Next.js for optimized static content delivery."},{"slug":"server-side-rendering","fullSlug":"/lessons/react-render-modes/server-side-rendering","title":"Server Side Rendering","order":"02C","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/02-react-render-modes/C-server-side-rendering.md","description":"Discover how to enhance your React app's performance with server-side rendering (SSR) as demonstrated by Brian Holt in the Intermediate React v6 course for Frontend Masters. Learn how to implement SSR by hand to optimize time to interactive and first meaningful paint, along with considerations for complexity and device performance. Explore practical examples of SSR app setup with Fastify, Vite, and React, including handling browser-only scripts and overcoming hydration errors."}],"order":"02"},{"icon":"file-code","title":"RSCs without a Framework","slug":"rscs-without-a-framework","lessons":[{"slug":"intro-to-react-server-components","fullSlug":"/lessons/rscs-without-a-framework/intro-to-react-server-components","title":"Intro to React Server Components","order":"03A","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/03-rscs-without-a-framework/A-intro-to-react-server-components.md","description":"In the Intermediate React v6 course by Brian Holt from Frontend Masters, explore the concept of React Server Components (RSCs) and their role in rendering components on the server for improved performance and security. Learn how RSCs differ from server-side rendering and how to implement them using frameworks like Next.js. The course also involves building a messaging app to practice hand-coding with RSCs."},{"slug":"rsc-dependencies","fullSlug":"/lessons/rscs-without-a-framework/rsc-dependencies","title":"RSC Dependencies","order":"03B","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/03-rscs-without-a-framework/B-rsc-dependencies.md","description":"Learn how to set up a React Server Components project from scratch using Webpack and Babel, with guidance from Brian Holt's Intermediate React v6 course on Frontend Masters. This comprehensive guide includes configuring Webpack, Babel, and Fastify to run RSCs efficiently without additional frameworks, enhancing your web development skills."},{"slug":"server-and-client-components","fullSlug":"/lessons/rscs-without-a-framework/server-and-client-components","title":"Server and Client Components","order":"03C","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/03-rscs-without-a-framework/C-server-and-client-components.md","description":"Learn how to build a simple React app with server and client components using React Server Components as taught by Brian Holt in Intermediate React v6 for Frontend Masters. Discover the differences between client and server components, and how to implement async functions in server components for efficient rendering."},{"slug":"the-rsc-server","fullSlug":"/lessons/rscs-without-a-framework/the-rsc-server","title":"The RSC Server","order":"03D","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/03-rscs-without-a-framework/D-the-rsc-server.md","description":"Explore how to use Fastify to serve a React app with server components by setting up a Node.js server that handles both client-side and server-side rendering. Written by Brian Holt for Frontend Masters, this guide offers step-by-step integration of React and Fastify, demonstrating the use of React Flight Protocol and reinforcing React's modular framework for advanced web development."}],"order":"03"},{"icon":"n","title":"RSCs with Next.js","slug":"rscs-with-nextjs","lessons":[{"slug":"abbreviated-intro-to-nextjs","fullSlug":"/lessons/rscs-with-nextjs/abbreviated-intro-to-nextjs","title":"Abbreviated Intro to Next.js","order":"04A","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/04-rscs-with-nextjs/A-abbreviated-intro-to-nextjs.md","description":"Explore Next.js and React Server Components (RSC) in the \"Intermediate React v6\" course by Brian Holt for Frontend Masters. This guide uses Next.js as a tool to demonstrate RSCs, covering basic setup, dependencies, and the implementation of essential page components for developing apps like Note Passer. Begin your Next.js journey with practical insights on integrating versatile front-end frameworks with a wide range of back-end solutions for web development success."},{"slug":"server-components","fullSlug":"/lessons/rscs-with-nextjs/server-components","title":"Server Components","order":"04B","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/04-rscs-with-nextjs/B-server-components.md","description":"Learn how to create a server component in React to display user-specific notes using SQLite, as part of the Intermediate React v6 course taught by Brian Holt for Frontend Masters. This lesson guides you through setting up a route to fetch and display notes for a logged-in user, leveraging async functions and server components."},{"slug":"server-actions","fullSlug":"/lessons/rscs-with-nextjs/server-actions","title":"Server Actions","order":"04C","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/04-rscs-with-nextjs/C-server-actions.md","description":"Learn how to create server actions in React using a backend function integration with forms, simplifying the process of managing form data in this lesson from Brian Holt's Intermediate React v6 course from Frontend Masters. This tutorial covers the implementation of server components to automatically handle data transport from frontend to backend without manual 'fetch' coding."},{"slug":"server-and-client-components-together","fullSlug":"/lessons/rscs-with-nextjs/server-and-client-components-together","title":"Server and Client Components Together","order":"04D","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/04-rscs-with-nextjs/D-server-and-client-components-together.md","description":"Learn how to effectively combine server and client components in React by implementing a polling system for real-time data updates, as explained by Brian Holt in Intermediate React v6 for Frontend Masters."},{"slug":"limitations-of-rscs","fullSlug":"/lessons/rscs-with-nextjs/limitations-of-rscs","title":"Limitations of RSCs","order":"04E","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/04-rscs-with-nextjs/E-limitations-of-rscs.md","description":"In the Intermediate React v6 course by Brian Holt for Frontend Masters, learn how to work with React Server Components (RSC) by implementing a client component that renders a server component, with special emphasis on overcoming data transmission barriers between them using pre-rendering and client-side APIs. Discover key insights on optimizing React applications with this advanced web development tutorial."}],"order":"04"},{"icon":"gauge-high","title":"Performance Optimizations","slug":"performance-optimizations","lessons":[{"slug":"where-react-can-be-slow","fullSlug":"/lessons/performance-optimizations/where-react-can-be-slow","title":"Where React Can Be Slow","order":"05A","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/05-performance-optimizations/A-where-react-can-be-slow.md","description":"Learn how to enhance React performance by using tools like memo, useMemo, and useCallback, as taught by Brian Holt in \"Intermediate React v6\" for Frontend Masters. Discover when to optimize your React components to avoid unnecessary re-renders and improve efficiency without preemptive adjustments. The course is perfect for developers seeking to refine their React skills with practical insights and advanced concepts."},{"slug":"the-project","fullSlug":"/lessons/performance-optimizations/the-project","title":"The Project","order":"05B","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/05-performance-optimizations/B-the-project.md","description":"Explore performance optimization techniques in React with Brian Holt's course \"Intermediate React v6\" as you build a markdown previewer using artificial jank for testing. This segment covers creating MarkdownPreview.jsx and App.jsx, addressing rendering issues, and demonstrating the use of dangerouslySetInnerHTML to prevent XSS attacks."},{"slug":"fixing-it","fullSlug":"/lessons/performance-optimizations/fixing-it","title":"Fixing It","order":"05C","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/05-performance-optimizations/C-fixing-it.md","description":"This guide explains how to optimize React component re-rendering using memoization techniques such as the memo function, useCallback, and useMemo, highlighting how these can prevent unnecessary re-renders by ensuring that a component only re-renders when its props or state variables change. Authored by Brian Holt for the Intermediate React v6 course, offered by Frontend Masters, this lesson is essential for web developers seeking to enhance React performance and manage state efficiently in their applications."},{"slug":"other-perf-questions","fullSlug":"/lessons/performance-optimizations/other-perf-questions","title":"Other Perf Questions","order":"05D","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/05-performance-optimizations/D-other-perf-questions.md","description":"Explore the differences between useMemo and useCallback Hooks in React, as explained by Brian Holt in the Intermediate React v6 course for Frontend Masters. Understand when to use these Hooks for performance optimization and learn about the potential pitfalls of overusing memoization, alongside insights into React Compiler. Enhance your React skills with practical advice on state management and performance enhancement techniques."}],"order":"05"},{"icon":"shuffle","title":"Transitions","slug":"transitions","lessons":[{"slug":"what-are-transitions","fullSlug":"/lessons/transitions/what-are-transitions","title":"What Are Transitions","order":"06A","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/06-transitions/A-what-are-transitions.md","description":"Learn how to use React's useTransition hook to optimize user experience when selecting options with poor network connectivity, ensuring the user interface remains interactive by building a sports score app with delayed API responses, as taught by Brian Holt in the 'Intermediate React v6' course for Frontend Masters."},{"slug":"the-project","fullSlug":"/lessons/transitions/the-project","title":"The Project","order":"06B","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/06-transitions/B-the-project.md","description":"Explore Brian Holt's 'Intermediate React v6' course where you'll build a scoreboard project using Vite and Node.js, focusing on transitions without server-side dependencies. Discover how to set up and run the project with practical guides, making use of the provided starter and completed templates from GitHub."},{"slug":"making-it-work-without-transitions","fullSlug":"/lessons/transitions/making-it-work-without-transitions","title":"Making It Work without Transitions","order":"06C","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/06-transitions/C-making-it-work-without-transitions.md","description":"Learn about handling UI transitions and pending states in React applications with this practical example from Brian Holt's \"Intermediate React v6.\" This lesson provides code snippets for managing API requests and displaying scores using a \"Score\" component, focusing on user experience improvements during data fetching."},{"slug":"making-it-work-with-transitions","fullSlug":"/lessons/transitions/making-it-work-with-transitions","title":"Making It Work with Transitions","order":"06D","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/06-transitions/D-making-it-work-with-transitions.md","description":"Learn how to implement React's useTransition hook to manage UI transitions effectively during API requests, as taught in Brian Holt's Intermediate React v6 course for Frontend Masters."}],"order":"06"},{"icon":"sun","title":"Optimistic Values","slug":"optimistic-values","lessons":[{"slug":"what-are-optimistic-values","fullSlug":"/lessons/optimistic-values/what-are-optimistic-values","title":"What Are Optimistic Values","order":"07A","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/07-optimistic-values/A-what-are-optimistic-values.md","description":"Discover the concept of optimistic UI updates in messaging apps, where the user interface reflects message sending before the actual network send, enhancing user experience. This approach, explained by Brian Holt in the Intermediate React v6 course, utilizes hooks like useOptimistic and useTransition to efficiently manage state changes in React applications."},{"slug":"the-project","fullSlug":"/lessons/optimistic-values/the-project","title":"The Project","order":"07B","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/07-optimistic-values/B-the-project.md","description":"Discover how to build a UI in React using server and client interactions including POST requests with intentional delays for error simulation, as outlined in Brian Holt's Intermediate React v6 course on Frontend Masters. Learn to handle UI feedback during asynchronous operations efficiently with techniques like useOptimisticState, enhancing your web development skills with JavaScript and server components."},{"slug":"useOptimistic-Hook","fullSlug":"/lessons/optimistic-values/useOptimistic-Hook","title":"useOptimistic Hook","order":"07C","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/07-optimistic-values/C-useOptimistic-Hook.md","description":"Discover how optimistic UI updates in messaging apps like iMessage or WhatsApp give users immediate visual feedback before a message is truly sent. Learn with Brian Holt in the Intermediate React v6 course for Frontend Masters, focusing on using React Server Components and hooks like useOptimistic and useTransition for seamless web development."}],"order":"07"},{"icon":"clock","title":"Deferred Values","slug":"deferred-values","lessons":[{"slug":"what-are-deferred-values","fullSlug":"/lessons/deferred-values/what-are-deferred-values","title":"What Are Deferred Values","order":"08A","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/08-deferred-values/A-what-are-deferred-values.md","description":"Learn how to manage computationally expensive components in React to prevent UI lag and improve performance in this Intermediate React v6 course by Brian Holt for Frontend Masters. Discover techniques to handle jank during frequent re-renders and optimize browser interactions in a client-side image editor project."},{"slug":"the-project","fullSlug":"/lessons/deferred-values/the-project","title":"The Project","order":"08B","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/08-deferred-values/B-the-project.md","description":"Learn how to utilize deferred values and sliders in React to apply dynamic filters to images, featuring examples like the 'DisplayImage' and 'Slider' components. Part of Intermediate React v6 by Brian Holt for Frontend Masters, this lesson covers implementing user input sliders, managing deferred values, and optimizing renders by simulating real-world application performance issues like jank. Perfect for developers looking to enhance their React skills with practical coding examples."},{"slug":"making-it-less-janky","fullSlug":"/lessons/deferred-values/making-it-less-janky","title":"Making It Less Janky","order":"08C","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/08-deferred-values/C-making-it-less-janky.md","description":"Learn how to optimize React performance using 'useDeferredValue' to manage low priority rendering, a tool that dynamically adapts to user's device speed, in Brian Holt's \"Intermediate React v6\" course by Frontend Masters."}],"order":"08"},{"icon":"crown","title":"Wrap Up","slug":"wrap-up","lessons":[{"slug":"congrats","fullSlug":"/lessons/wrap-up/congrats","title":"Congrats!","order":"09A","path":"/home/runner/work/intermediate-react-v6/intermediate-react-v6/lessons/09-wrap-up/A-congrats.md","description":"Congratulations on completing Intermediate React v6 by Brian Holt, taught through Frontend Masters. You're now ready to deploy and enhance your React projects, exploring cloud integration with services like Vercel and Neon, and adding advanced features like authentication and social media-like functionalities. Share your builds and innovations with the community and continue to expand your skills in web development."}],"order":"09"}]},"__N_SSG":true}